
mounth = int(input('Введите месяц'))
# Вариант1
age = {
    '12' : "Зима",
    '1' : "Зима",
    '2' : "Зима",
    '3' : "Весна",
    '4': "Весна",
    '5' : "Весна",
    '6' : "Лето",
    '7' : "Лето",
    '8' : "Лето",
    '9' : "Осень",
    '10' : "Осень",
    '11' : "Осень"
}
print(age[str(mounth)])
# Вариант2
age = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
print(age[mounth-1])
# Вариант3
age = {
  'Зима': [12, 1, 2],
  'Весна': [3, 4, 5],
  'Лето': [6, 7, 8],
  'Осень': [9, 10, 11]
}
result = None
for i in age:
  if mounth in age[i]:
      result = i
      break
  else:
      result = 'There is no such month'

print(result)